import { Injectable, Inject } from '@angular/core';
import { DOCUMENT } from '@angular/common';
interface arrayFAQ {
  question: string;
  answer: string;
}
@Injectable({
  providedIn: 'root',
})
export class FaqservService {
  faqs!: Array<arrayFAQ>;

  faqsRuOwl=[
    {
      question: 'Где можно посмотреть торговую статистику?',
      answer:
        'На нашем сайте представлен публичный торговый счёт ученика с сервера MQL5. Вы можете ознакомиться с подробной статистикой торговли, включая прибыльность, риски и историю сделок.',
    },
    {
      question: 'Как начать обучение?',
      answer:
        'Программу обучения нужно  изучать последовательно в той очередности тем которые указаны на сайте',
    },
    {
      question: 'Кому подходит этот курс?',
      answer:
        'Курс предназначен для начинающих трейдеров, желающих освоить основы биржевой торговли. Он также будет полезен тем, кто уже имеет базовые знания и стремится систематизировать и углубить свои навыки.',
    },
    {
      question: 'Какие темы входят в курс?',
      answer:
        'Курс включает следующие разделы: Введение в трейдинг, Технический анализ, Объемный анализ, Концепция Smart Money, Психология трейдинга, Фундаментальный анализ, Криптовалюты, Примеры сделок',
    },
    {
      question: 'Нужно ли платить за обучение?',
      answer:
        'Нет, курс полностью бесплатный и доступен для самостоятельного изучения без каких-либо скрытых платежей.',
    },
    {
      question: 'Есть ли торговая система в курсе?',
      answer:
        'Да, курс включают торговую систему -  практические примеры сделок и видео-уроки, демонстрирующие применение теоретических знаний на практике.',
    },
  ]


  faqsRuPages=[
     {
      question: 'Как поменять язык сайта?',
      answer:
        'В правом верхнем углу нажмите на иконку значка флага и выберите подходящий вам язык.',
    },
     {
      question: 'Как связаться с нами?',
      answer:
        'Юридический адрес с регистрацией доступен для всех желающих на главной странице сайта с подробным указанием контактной информации',
    },
    {
      question: 'Какие разделы  трейдинга бесплатны?',
      answer:
        'Бесплатное обучение трейдингу включает следующие разделы: Введение в трейдинг, Технический анализ, Объемный анализ, Концепция Smart Money, Психология трейдинга, Фундаментальный анализ, Криптовалюты, Примеры сделок',
    },
    {
      question: 'Нужны ли специальные программы или платформы для прохождения курса?',
      answer:
        'Нет, все материалы доступны онлайн через ваш веб-браузер. Однако для практики трейдинга рекомендуется установить торговую платформу, подходящую для ваших целей.',
    },
    {
      question: 'Как записаться на платный курс с наставником?',
      answer:
        'Контактная информация для связи  указана на сайте. Вы можете использовать предоставленные средства связи для получения дополнительной информации или консультаций.',
    },
  ]


   faqsRuAuthor = [
    {
      question: 'Как поменять язык сайта?',
      answer:
        'В правом верхнем углу нажмите на иконку значка флага и выберите подходящий вам язык.',
    },
    {
      question: 'Как связаться с нами?',
      answer:
        'Юридический адрес с регистрацией доступен для всех желающих на главной странице сайта с подробным указанием контактной информации',
    },
    {
      question: 'Кто автор курсов?',
      answer:
        'Арапов Игорь Витальевич , опыт в трейдинге с 2013г. , активно представлен в социальных сетях и Tradingview неоднократно побеждал в номинации "выбор редакции" , Автор Бесплатного Курса по трейдингу "Обучение Трейдингу с Нуля"',
    },
    {
      question: 'Как записаться на платный курс с наставником?',
      answer:
        'Контактная информация для связи  указана на сайте. Вы можете использовать предоставленные средства связи для получения дополнительной информации или консультаций.',
    },
   ]

  faqsRuCourse = [
    {
      question: 'Где можно посмотреть торговую статистику?',
      answer:
        'На нашем сайте представлен публичный торговый счёт ученика с сервера MQL5. Вы можете ознакомиться с подробной статистикой торговли, включая прибыльность, риски и историю сделок.',
    },
     {
      question: 'Как начать обучение?',
      answer:
        'Вы можете обучаться самостоятельно используя бесплатный курс или записаться на обучение с наставником по форме обратной связи',
    },
    {
      question: 'Кому подходит этот курс?',
      answer:
        'Курс предназначен  как для начинающих трейдеров, так и опытных  желающих освоить правила биржевой торговли.  Курс поможет  систематизировать и углубить свои навыки , вне зависимости от опыта',
    },
    {
      question: 'Какие темы входят в курс?',
      answer:
        'Курс включает следующие разделы: Введение в трейдинг, Технический анализ, Объемный анализ, Концепция Smart Money, Психология трейдинга, Фундаментальный анализ, Криптовалюты, Примеры сделок',
    },
    {
      question: 'Есть ли торговая система в курсе?',
      answer:
        'Да, курс включают торговую систему -  практические примеры сделок и видео-уроки, демонстрирующие применение теоретических знаний на практике.',
    },
  ];
  languageForFAQ = 'uk';

  faqsUkrOwl=[
    {
      question: 'Де можна переглянути торговельну статистику?',
      answer:
        'На нашому сайті представлений публічний торговельний рахунок учня з сервера MQL5. Ви можете ознайомитися з детальною статистикою торгівлі, включаючи прибутковість, ризики та історію угод.',
    },
    {
      question: 'Як розпочати навчання?',
      answer:
        'Програму навчання потрібно вивчати послідовно в тій черговості тем, які вказані на сайті.',
    },
    {
      question: 'Кому підходить цей курс?',
      answer:
        'Курс призначений для початківців трейдерів, які бажають освоїти основи біржової торгівлі. Він також буде корисним для тих, хто вже має базові знання і прагне систематизувати та поглибити свої навички.',
    },
    {
      question: 'Які теми входять до курсу?',
      answer:
        'Курс включає наступні розділи: Вступ до трейдингу, Технічний аналіз, Об’ємний аналіз, Концепція Smart Money, Психологія трейдингу, Фундаментальний аналіз, Криптовалюти, Приклади угод.',
    },
    {
      question: 'Чи потрібно платити за навчання?',
      answer:
        'Ні, курс повністю безкоштовний і доступний для самостійного вивчення без будь-яких прихованих платежів.',
    },
    {
      question: 'Чи є торгова система в курсі?',
      answer:
        'Так, курс включає торгову систему - практичні приклади угод і відеоуроки, що демонструють застосування теоретичних знань на практиці.',
    },
  ]

faqsUkrPages=[
     {
      question: 'Як змінити мову сайту?',
      answer:
        'У правому верхньому куті натисніть на іконку прапора і виберіть потрібну вам мову.',
    },
     {
      question: 'Як зв’язатися з нами?',
      answer:
        'Юридична адреса з реєстрацією доступна для всіх бажаючих на головній сторінці сайту з детальним зазначенням контактної інформації.',
    },
    {
      question: 'Які розділи трейдингу безкоштовні?',
      answer:
        'Безкоштовне навчання трейдингу включає наступні розділи: Вступ до трейдингу, Технічний аналіз, Об’ємний аналіз, Концепція Smart Money, Психологія трейдингу, Фундаментальний аналіз, Криптовалюти, Приклади угод.',
    },
    {
      question: 'Чи потрібні спеціальні програми або платформи для проходження курсу?',
      answer:
        'Ні, всі матеріали доступні онлайн через ваш веб-браузер. Однак для практики трейдингу рекомендується встановити торгову платформу, яка підходить для ваших цілей.',
    },
    {
      question: 'Як записатися на платний курс з наставником?',
      answer:
        'Контактна інформація для зв’язку вказана на сайті. Ви можете використовувати надані засоби зв’язку для отримання додаткової інформації або консультацій.',
    },
  ]

faqsUkrAuthor = [
    {
      question: 'Як змінити мову сайту?',
      answer:
        'У правому верхньому куті натисніть на іконку прапора і виберіть потрібну вам мову.',
    },
    {
      question: 'Як зв’язатися з нами?',
      answer:
        'Юридична адреса з реєстрацією доступна для всіх бажаючих на головній сторінці сайту з детальним зазначенням контактної інформації.',
    },
    {
      question: 'Хто автор курсів?',
      answer:
        'Арапов Ігор Віталійович, досвід у трейдингу з 2013 року, активно представлений у соціальних мережах і Tradingview, неодноразово перемагав у номінації "вибір редакції", автор безкоштовного курсу з трейдингу "Навчання трейдингу з нуля".',
    },
    {
      question: 'Як записатися на платний курс з наставником?',
      answer:
        'Контактна інформація для зв’язку вказана на сайті. Ви можете використовувати надані засоби зв’язку для отримання додаткової інформації або консультацій.',
    },
]

faqsUkrCourse = [
    {
      question: 'Де можна переглянути торговельну статистику?',
      answer:
        'На нашому сайті представлений публічний торговельний рахунок учня з сервера MQL5. Ви можете ознайомитися з детальною статистикою торгівлі, включаючи прибутковість, ризики та історію угод.',
    },
     {
      question: 'Як розпочати навчання?',
      answer:
        'Ви можете навчатися самостійно, використовуючи безкоштовний курс, або записатися на навчання з наставником за формою зворотного зв’язку.',
    },
    {
      question: 'Кому підходить цей курс?',
      answer:
        'Курс призначений як для початківців трейдерів, так і для досвідчених, які бажають освоїти правила біржової торгівлі. Курс допоможе систематизувати та поглибити навички, незалежно від досвіду.',
    },
    {
      question: 'Які теми входять до курсу?',
      answer:
        'Курс включає наступні розділи: Вступ до трейдингу, Технічний аналіз, Об’ємний аналіз, Концепція Smart Money, Психологія трейдингу, Фундаментальний аналіз, Криптовалюти, Приклади угод.',
    },
    {
      question: 'Чи є торгова система в курсі?',
      answer:
        'Так, курс включає торгову систему - практичні приклади угод і відеоуроки, що демонструють застосування теоретичних знань на практиці.',
    },
];
  constructor(@Inject(DOCUMENT) private document: Document) {}

  returnSchema(langcode: string, path:string) {

    

      if(path==''){
        this.faqs=this.faqsUkrAuthor
      }else if(langcode == 'uk'&&path=='uk'){
         this.faqs=this.faqsUkrAuthor
      }else if(langcode == 'ru'&&path=='ru'){
         this.faqs=this.faqsRuAuthor
      }else if(langcode == 'ru'&&path=='ru/studying'){
         this.faqs=this.faqsRuCourse
      }
      else if(langcode == 'uk'&&path=='uk/studying'){
         this.faqs=this.faqsUkrCourse
      }
      else if(langcode == 'uk'&&path=='uk/freestudying/freeeducation'){
         this.faqs=this.faqsUkrOwl
      }
      else if(langcode == 'ru'&&path=='ru/freestudying/freeeducation'){
         this.faqs=this.faqsRuOwl
      }
      else if(langcode == 'ru'){
         this.faqs=this.faqsRuPages
      }else{
        this.faqs=this.faqsUkrPages
      }



// this.faqs=this.faqsUkrPages
 

    let schema = {
      '@context': 'https://schema.org',
      '@type': 'FAQPage',
      mainEntity: this.faqs.map((faq) => ({
        '@type': 'Question',
        name: faq.question,
        acceptedAnswer: { '@type': 'Answer', text: faq.answer },
      })),
    };
    return schema;
  }
}
