import { Injectable, Inject } from '@angular/core';
import { DOCUMENT } from '@angular/common';
interface arrayFAQ {
  question: string;
  answer: string;
}
@Injectable({
  providedIn: 'root',
})
export class FaqservService {
  faqs!: Array<arrayFAQ>;
  faqsUKR = [
    {
      question: 'Де можна подивитися торгову статистику?',
      answer:
        'На нашому сайті представлений публічний торговий рахунок учня з сервера MQL5. Ви можете ознайомитися з детальною статистикою торгівлі, включаючи прибутковість, ризики та історію угод.',
    },
    {
      question: 'Як змінити мову сайту?',
      answer:
        'У правому верхньому куті натисніть на іконку прапора та виберіть потрібну вам мову.',
    },
    {
      question: 'Як зв’язатися з нами?',
      answer:
        'Юридична адреса з реєстрацією доступна для всіх бажаючих на головній сторінці сайту з детальним зазначенням контактної інформації.',
    },
    {
      question: 'Як розпочати навчання?',
      answer:
        'Програму навчання потрібно вивчати послідовно в тій черговості тем, які вказані на сайті.',
    },
    {
      question: 'Кому підходить цей курс?',
      answer:
        'Курс призначений для початківців-трейдерів, які бажають опанувати основи біржової торгівлі. Він також буде корисним для тих, хто вже має базові знання і прагне систематизувати та поглибити свої навички.',
    },
    {
      question: 'Які теми входять до курсу?',
      answer:
        'Курс включає наступні розділи: Вступ до трейдингу, Технічний аналіз, Об’ємний аналіз, Концепція Smart Money, Психологія трейдингу, Фундаментальний аналіз, Криптовалюти, Приклади угод.',
    },
    {
      question: 'Чи потрібно платити за навчання?',
      answer:
        'Ні, курс повністю безкоштовний і доступний для самостійного вивчення без будь-яких прихованих платежів.',
    },
    {
      question: 'Чи є торгова система в курсі?',
      answer:
        'Так, курс включає торгову систему — практичні приклади угод та відеоуроки, що демонструють застосування теоретичних знань на практиці.',
    },
    {
      question:
        'Чи потрібні спеціальні програми або платформи для проходження курсу?',
      answer:
        'Ні, усі матеріали доступні онлайн через ваш веб-браузер. Однак для практики трейдингу рекомендується встановити торгову платформу, що підходить для ваших цілей.',
    },
    {
      question: 'Як записатися на платний курс із наставником?',
      answer:
        'Контактна інформація для зв’язку вказана на сайті. Ви можете використовувати надані засоби зв’язку для отримання додаткової інформації або консультацій.',
    },
  ];

  faqsRu = [
    {
      question: 'Где можно посмотреть торговую статистику?',
      answer:
        'На нашем сайте представлен публичный торговый счёт ученика с сервера MQL5. Вы можете ознакомиться с подробной статистикой торговли, включая прибыльность, риски и историю сделок.',
    },
    {
      question: 'Как поменять язык сайта?',
      answer:
        'В правом верхнем углу нажмите на иконку значка флага и выберите подходящий вам язык.',
    },
    {
      question: 'Как связаться с нами?',
      answer:
        'Юридический адрес с регистрацией доступен для всех желающих на главной странице сайта с подробным указанием контактной информации',
    },

    {
      question: 'Как начать обучение?',
      answer:
        'Программу обучения нужно  изучать последовательно в той очередности тем которые указаны на сайте',
    },
    {
      question: 'Кому подходит этот курс?',
      answer:
        'Курс предназначен для начинающих трейдеров, желающих освоить основы биржевой торговли. Он также будет полезен тем, кто уже имеет базовые знания и стремится систематизировать и углубить свои навыки.',
    },
    {
      question: 'Какие темы входят в курс?',
      answer:
        'Курс включает следующие разделы: Введение в трейдинг, Технический анализ, Объемный анализ, Концепция Smart Money, Психология трейдинга, Фундаментальный анализ, Криптовалюты, Примеры сделок',
    },
    {
      question: 'Нужно ли платить за обучение?',
      answer:
        'Нет, курс полностью бесплатный и доступен для самостоятельного изучения без каких-либо скрытых платежей.',
    },
    {
      question: 'Есть ли торговая система в курсе?',
      answer:
        'Да, курс включают торговую систему -  практические примеры сделок и видео-уроки, демонстрирующие применение теоретических знаний на практике.',
    },
    {
      question:
        'Нужны ли специальные программы или платформы для прохождения курса?',
      answer:
        'Нет, все материалы доступны онлайн через ваш веб-браузер. Однако для практики трейдинга рекомендуется установить торговую платформу, подходящую для ваших целей.',
    },
    {
      question: 'Как записаться на платный курс с наставником?',
      answer:
        'Контактная информация для связи  указана на сайте. Вы можете использовать предоставленные средства связи для получения дополнительной информации или консультаций.',
    },
  ];
  languageForFAQ = 'uk';
  constructor(@Inject(DOCUMENT) private document: Document) {}

  returnSchema(langcode: string) {
    this.faqs = langcode == 'uk' || langcode == '' ? this.faqsUKR : this.faqsRu;
    let schema = {
      '@context': 'https://schema.org',
      '@type': 'FAQPage',
      mainEntity: this.faqs.map((faq) => ({
        '@type': 'Question',
        name: faq.question,
        acceptedAnswer: { '@type': 'Answer', text: faq.answer },
      })),
    };
    return schema;
  }
}
