import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class FaqUkPagesService {

  constructor() { }

  faqsUkrPages=[
       {
        question: 'Як змінити мову сайту?',
        answer:
          'У правому верхньому куті натисніть на іконку прапора і виберіть потрібну вам мову.',
      },
       {
        question: 'Як зв’язатися з нами?',
        answer:
          'Юридична адреса з реєстрацією доступна для всіх бажаючих на головній сторінці сайту з детальним зазначенням контактної інформації.',
      },
      {
        question: 'Які розділи трейдингу безкоштовні?',
        answer:
          'Безкоштовне навчання трейдингу включає наступні розділи: Вступ до трейдингу, Технічний аналіз, Об’ємний аналіз, Концепція Smart Money, Психологія трейдингу, Фундаментальний аналіз, Криптовалюти, Приклади угод.',
      },
      {
        question: 'Чи потрібні спеціальні програми або платформи для проходження курсу?',
        answer:
          'Ні, всі матеріали доступні онлайн через ваш веб-браузер. Однак для практики трейдингу рекомендується встановити торгову платформу, яка підходить для ваших цілей.',
      },
      {
        question: 'Як записатися на платний курс з наставником?',
        answer:
          'Контактна інформація для зв’язку вказана на сайті. Ви можете використовувати надані засоби зв’язку для отримання додаткової інформації або консультацій.',
      },
    ]

    getFaq(){
      return this.faqsUkrPages
     }
}
