import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class FaqUKCourseService {

  constructor() { }

  faqsUkrCourse = [
      {
        question: 'Де можна переглянути торговельну статистику?',
        answer:
          'На нашому сайті представлений публічний торговельний рахунок учня з сервера MQL5. Ви можете ознайомитися з детальною статистикою торгівлі, включаючи прибутковість, ризики та історію угод.',
      },
       {
        question: 'Як розпочати навчання?',
        answer:
          'Ви можете навчатися самостійно, використовуючи безкоштовний курс, або записатися на навчання з наставником за формою зворотного зв’язку.',
      },
      {
        question: 'Кому підходить цей курс?',
        answer:
          'Курс призначений як для початківців трейдерів, так і для досвідчених, які бажають освоїти правила біржової торгівлі. Курс допоможе систематизувати та поглибити навички, незалежно від досвіду.',
      },
      {
        question: 'Які теми входять до курсу?',
        answer:
          'Курс включає наступні розділи: Вступ до трейдингу, Технічний аналіз, Об’ємний аналіз, Концепція Smart Money, Психологія трейдингу, Фундаментальний аналіз, Криптовалюти, Приклади угод.',
      },
      {
        question: 'Чи є торгова система в курсі?',
        answer:
          'Так, курс включає торгову систему - практичні приклади угод і відеоуроки, що демонструють застосування теоретичних знань на практиці.',
      },
  ];

  getFaq(){
      return this.faqsUkrCourse
     }
}
