import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class FaqUkOwlService {

  constructor() { }

  faqsUkrOwl=[
      {
        question: 'Де можна переглянути торговельну статистику?',
        answer:
          'На нашому сайті представлений публічний торговельний рахунок учня з сервера MQL5. Ви можете ознайомитися з детальною статистикою торгівлі, включаючи прибутковість, ризики та історію угод.',
      },
      {
        question: 'Як розпочати навчання?',
        answer:
          'Програму навчання потрібно вивчати послідовно в тій черговості тем, які вказані на сайті.',
      },
      {
        question: 'Кому підходить цей курс?',
        answer:
          'Курс призначений для початківців трейдерів, які бажають освоїти основи біржової торгівлі. Він також буде корисним для тих, хто вже має базові знання і прагне систематизувати та поглибити свої навички.',
      },
      {
        question: 'Які теми входять до курсу?',
        answer:
          'Курс включає наступні розділи: Вступ до трейдингу, Технічний аналіз, Об’ємний аналіз, Концепція Smart Money, Психологія трейдингу, Фундаментальний аналіз, Криптовалюти, Приклади угод.',
      },
      {
        question: 'Чи потрібно платити за навчання?',
        answer:
          'Ні, курс повністю безкоштовний і доступний для самостійного вивчення без будь-яких прихованих платежів.',
      },
      {
        question: 'Чи є торгова система в курсі?',
        answer:
          'Так, курс включає торгову систему - практичні приклади угод і відеоуроки, що демонструють застосування теоретичних знань на практиці.',
      },
    ]

    getFaq(){
      return this.faqsUkrOwl
     }
}
