import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class FaqUkAuthorService {

  constructor() { }

  faqsUkrAuthor = [
      {
        question: 'Як змінити мову сайту?',
        answer:
          'У правому верхньому куті натисніть на іконку прапора і виберіть потрібну вам мову.',
      },
      {
        question: 'Як зв’язатися з нами?',
        answer:
          'Юридична адреса з реєстрацією доступна для всіх бажаючих на головній сторінці сайту з детальним зазначенням контактної інформації.',
      },
      {
        question: 'Хто автор курсів?',
        answer:
          'Арапов Ігор Віталійович, досвід у трейдингу з 2013 року, активно представлений у соціальних мережах і Tradingview, неодноразово перемагав у номінації "вибір редакції", автор безкоштовного курсу з трейдингу "Навчання трейдингу з нуля".',
      },
      {
        question: 'Як записатися на платний курс з наставником?',
        answer:
          'Контактна інформація для зв’язку вказана на сайті. Ви можете використовувати надані засоби зв’язку для отримання додаткової інформації або консультацій.',
      },
  ]

  getFaq(){
      return this.faqsUkrAuthor
     }
}
